SeongMin1000/Embedded_System/micro_os/NUCLEO-f429zi_example_code (updated)/Examples/ST/STM32F429II-SK/OS3/app.c
/*
*********************************************************************************************************
*                                           TASK FUNCTION
*********************************************************************************************************
*/

static void AppTaskStart(void *p_arg)
{
  OS_ERR err;

  (void)p_arg;

  // HW INIT
  BSP_Init();
  BSP_Tick_Init();
  Buzzer_Init();
  TouchSensor_Init();
  KnockSensor_Init();
  //  JoyStick_Init();
  //  Button_Init();
  USART_Config();

  Buzzer_Off();

  // Alarm Flag create
  OSFlagCreate(&AlarmFlagGroup, "Alarm Flag Group", (OS_FLAGS)0, &err);
  // Usart Message Queue create
  OSQCreate(&USARTMsgQ, "USART Msg Queue", 10, &err);
  // Sensor Input Queue create
  OSQCreate(&SensorInputQ, "Sensor Input Queue", 10, &err);

#if OS_CFG_STAT_TASK_EN > 0u
  OSStatTaskCPUUsageInit(&err);
#endif

#ifdef CPU_CFG_INT_DIS_MEAS_EN
  CPU_IntDisMeasMaxCurReset();
#endif

  ApptaskCreate(NULL);
}

static void ApptaskCreate(void *p_arg)
{
  OS_ERR err;
  (void)p_arg;

  // buzzer task create (PRIO 3)
  OSTaskCreate(&TCB_Buzzer,
               "Buzzer Task",
               BuzzerTask,
               0,
               BUZZER_TASK_PRIO,
               &STK_Buzzer[0],
               BUZZER_TASK_STK_SIZE / 10,
               BUZZER_TASK_STK_SIZE,
               0,
               0,
               0,
               OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
               &err);

  // touch sensor task create (PRIO 4)
  OSTaskCreate(&TCB_Touch,
               "Touch Sensor Task",
               TouchSensorTask,
               0,
               TOUCH_TASK_PRIO,
               &STK_Touch[0],
               TOUCH_TASK_STK_SIZE / 10,
               TOUCH_TASK_STK_SIZE,
               0,
               0,
               0,
               OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
               &err);

  // mission task create (PRIO 5)
  OSTaskCreate(&TCB_Mission,
               "Mission Task",
               MissionTask,
               0,
               MISSION_TASK_PRIO,
               &STK_Mission[0],
               MISSION_TASK_STK_SIZE / 10,
               MISSION_TASK_STK_SIZE,
               0,
               0,
               0,
               OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
               &err);

  // knock sensor task create(PRIO 6)
  OSTaskCreate(&TCB_Knock,
               "Knock Sensor Task",
               KnockSensorTask,
               0,
               KNOCK_TASK_PRIO,
               &STK_Knock[0],
               KNOCK_TASK_STK_SIZE / 10,
               KNOCK_TASK_STK_SIZE,
               0,
               0,
               0,
               OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
               &err);


   OSTaskCreate(&TCB_Joystick,
                "Joystick Task",
               JoystickTask,
                0,
                JOYSTICK_PRIO,
                &STK_Joystick[0],
                JOYSTICK_STK_SIZE / 10,
                JOYSTICK_STK_SIZE,
                0,
                0,
                0,
                OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                &err);

  // button task create (PRIO 6)
  // OSTaskCreate(&TCB_Button,
  //              "Button Task",
  //              ButtonTask,
  //              0,
  //              BUTTON_TASK_PRIO,
  //              &STK_Button[0],
  //              BUTTON_TASK_STK_SIZE / 10,
  //              BUTTON_TASK_STK_SIZE,
  //              0,
  //              0,
  //              0,
  //              OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
  //              &err);

  // USART task create (PRIO 7)
  OSTaskCreate(&TCB_USART,
               "USART Task",
               USARTTask,
               0,
               USART_TASK_PRIO,
               &STK_USART[0],
               USART_TASK_STK_SIZE / 10,
               USART_TASK_STK_SIZE,
               0,
               0,
               0,
               OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
               &err);
}

// Buzzer Task
static void BuzzerTask(void *p_arg)
{
  OS_ERR err;
  OS_FLAGS flags;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 1. 알람 발생까지 대기 (알람 ON 신호 올 때까지 무한대기)
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_BUZZER,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_BLOCKING,
                       0,
                       &err);

    OSFlagPend(&AlarmFlagGroup,
               ALARM_FLAG_OFF,
               0,
               OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_NON_BLOCKING,
               0,
               &err);

    // 2. 부저 울림 반복 (알람 OFF 신호 올 때까지)
    static const char msg_on[] = "\r\n[부저] 알람이 울리는 중...\r\n 터치 센서를 눌러 미션을 수행하세요!\r\n";
    OSQPost(&USARTMsgQ, (void *)msg_on, sizeof(msg_on), OS_OPT_POST_FIFO, &err);

    while (DEF_TRUE)
    {
      // 깜빡임 효과 (비프 ON)
      Buzzer_On();
      OSTimeDlyHMSM(0, 0, 0, 500, OS_OPT_TIME_HMSM_STRICT, &err); // 0.3초 ON

      // 깜빡임 효과 (비프 OFF)
      Buzzer_Off();
      OSTimeDlyHMSM(0, 0, 0, 500, OS_OPT_TIME_HMSM_STRICT, &err); // 0.2초 OFF

      // 알람 OFF 신호가 들어왔는지 체크
      if (OSFlagPend(&AlarmFlagGroup, ALARM_FLAG_OFF, 0,
                     OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_NON_BLOCKING,
                     0, &err))
      {
        break;
      }
    }

    // 3. 부저 완전히 종료
    Buzzer_Off();
    static const char msg_off[] = "[부저] 알람이 해제되었습니다.\r\n";
    OSQPost(&USARTMsgQ, (void *)msg_off, sizeof(msg_off), OS_OPT_POST_FIFO, &err);
  }
}

// Touch Sensor Task
static void TouchSensorTask(void *p_arg)
{
  OS_ERR err;
  OS_FLAGS flags;
  uint8_t prev, curr;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 1. 알람 울림 신호 기다림
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_TOUCH,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_BLOCKING,
                       0,
                       &err);


    // 2. 터치센서 OFF될 때까지 대기
    while (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_3) == Bit_SET)
    {
      OSTimeDlyHMSM(0, 0, 0, 20, OS_OPT_TIME_HMSM_STRICT, &err);
    }
    prev = Bit_RESET;

